app/models/event.rb

  def last_attendance
# Latest event hosted at this venue
    events = Event.where(start_date: self.start_date).where(event_venue: self.event_venue)
    if events.length > 0
---
SELECT "events".* FROM "events" WHERE "events"."start_date" = ? AND "events"."event_venue_id" = ?  [["start_date", "2017-07-01"], ["event_venue_id", 1]]
SELECT "events".* FROM "events" WHERE "events"."start_date" = ? AND "events"."event_venue_id" = ?  [["start_date", "2019-03-01"], ["event_venue_id", 4]]