app/models/ticket.rb

SELECT  "ticket_types"."event_id" FROM "ticket_types" WHERE "ticket_types"."id" = ? ORDER BY "ticket_types"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "orders"."created_at" FROM "orders" WHERE "orders"."id" = ?  [["id", 1]]
SELECT  1 AS one FROM "events" WHERE "events"."id" IN (SELECT "ticket_types"."id" FROM "ticket_types" WHERE "ticket_types"."id" IN (SELECT "tickets"."id" FROM "tickets" WHERE "tickets"."id" = ?)) LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT  1 AS one FROM "ticket_types" WHERE "ticket_types"."event_id" = ? AND "ticket_types"."id" = ? LIMIT ?  [["event_id", nil], ["id", 1], ["LIMIT", 1]]
SELECT "events"."start_date" FROM "events" WHERE "events"."id" IN (SELECT "ticket_types"."id" FROM "ticket_types" WHERE "ticket_types"."id" IN (SELECT "tickets"."id" FROM "tickets" WHERE "tickets"."id" = ?))  [["id", 38]]
---
  belongs_to :order

  before_save do
    event_date = Event.where(id: TicketType.where(id: self.ticket_type).select("event_id")).select("start_date")
    sbeve = Order.where(id: self.order).select("created_at")
    if !event_date.empty?